## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_network_security_group.main_nsg will be created
  + resource "azurerm_network_security_group" "main_nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "main-nsg"
      + resource_group_name = "main-resource-group"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "Allow_HTTPS"
              + priority                                   = 200
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          + {
              + access                                     = "Deny"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "Deny_All_Inbound"
              + priority                                   = 300
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
        ]
    }

  # azurerm_resource_group.champions_group will be created
  + resource "azurerm_resource_group" "champions_group" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "champions-group"
    }

  # azurerm_resource_group.main_rg will be created
  + resource "azurerm_resource_group" "main_rg" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "main-resource-group"
    }

  # azurerm_resource_group.state-demo-secure will be destroyed
  # (because azurerm_resource_group.state-demo-secure is not in configuration)
  - resource "azurerm_resource_group" "state-demo-secure" {
      - id       = "/subscriptions/e77db16d-5ea4-4932-b1f7-066315e7b399/resourceGroups/champions-group" -> null
      - location = "eastus" -> null
      - name     = "champions-group" -> null
    }

  # azurerm_resource_group.test_main_group will be created
  + resource "azurerm_resource_group" "test_main_group" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "test-main"
    }

  # azurerm_subnet.main_subnet will be created
  + resource "azurerm_subnet" "main_subnet" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "main-subnet"
      + resource_group_name                            = "main-resource-group"
      + virtual_network_name                           = "main-vnet"
    }

  # azurerm_subnet_network_security_group_association.main_subnet_nsg will be created
  + resource "azurerm_subnet_network_security_group_association" "main_subnet_nsg" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.main_vnet will be created
  + resource "azurerm_virtual_network" "main_vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "main-vnet"
      + resource_group_name = "main-resource-group"
      + subnet              = (known after apply)
    }

Plan: 7 to add, 0 to change, 1 to destroy.
```
</details>